# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# 1 способ

poem = "Сказать 'прости' — что камень кинуть, \nсказать 'люблю' — так тоже без проблем! \nЖивём в каком-то странном мире, где человек становится никем, \nгде вес словам... — да нет его в помине, как нет ни чувств, ни боли, ни души. \nВ потёмках суеты утопли, как в трясине, продались за ничтожные гроши. \nПропала вера в искренних прохожих — глаза погасли, стук в груди утих. \nКазалось, хуже быть уже не может, но всё же может: я — один из них."



print(poem)